// const alphabetList = ["A","B","C","D","E","F","G","H"];
// 65~72
export const alphabetList = Array.from({ length: 8 }, (__, i) =>
  String.fromCharCode(i + 65)
);
export const commingList = [
  {
    title: "1번국도",
    imageUrl: "/1번국도.jpeg",
    movieUrl: "https://www.youtube.com/watch?v=f-AFAdByzFE",
    summary:
      "사채업자에게 고용된 일두는 채무자의 딸 윤서를 윤락가에 팔아 넘기기 위해 1번국도를 따라 달린다. 자신의 운명을 체념한 듯한 윤서는 저항없이 일두를 따라 나선다. 더 이상 갈 수 없는 끊어진 길에서 만난 미스터리 남자 ‘유씨’. 1번국도 그 길을 따라 세 사람은 여정을 함께한다. 그런데 시간이 지날수록 일두는 범상치 않은 윤서를 내버려두고 갈 수 없는 마음이 커져가는데… 떠날 곳도 돌아갈 곳도 가진 것도 없는 자들의 여정이 시작된다!",
  },
  {
    title: "견왕",
    imageUrl: "/견왕.jpeg",
    movieUrl: "https://www.youtube.com/watch?v=SbZoLqpYPzI",
    summary:
      "무로마치의 교토, 사루가쿠(무로마치 시대에 성행한 일본 전통 예능)의 일원으로 태어난 남들과는 다른 모습을 한 아이, ‘견왕’. 주위 사람들은 그를 멀리했고 그의 얼굴은 표주박 가면으로 가려졌다. 그러던 어느 날, 견왕은 타이라 가문의 저주로 장님이 된 비파법사 소년, ‘토모나’를 만나게 된다. 한 순간에 펼쳐지는 두 사람만의 호흡, 두 사람만의 세계. 정상에 도달한 두 사람을 기다리고 있는 것은?",
  },
  {
    title: "마이선",
    imageUrl: "/마이선.jpeg",
    movieUrl: "https://www.youtube.com/watch?v=uxTOxh_edkU",
    summary:
      "작가로서의 삶을 포기한 채 선천적 지체장애를 가진 아들 현재를 돌보고 있는 민석. 소년에서 성인이 되어가는 현재가 장애인 활동지원사인 기철과 독립을 꿈꾸며 민석과 갈등을 빚게 된다. 그러던 어느 날 예기치 못한 사고로 민석의 몸에 이상이 생긴 것을 알게 되고, 현재와 가족들의 일상이 변하게 되는데… “아빠는 점점 죽어가고 있어…” 보통의 평범한 일상이 힘든 모든 이들을 위한 영화가 온다!",
  },
  {
    title: "보디가드",
    imageUrl: "/보디가드.jpeg",
    movieUrl: "https://www.youtube.com/watch?v=kmcZXxarkp0",
    summary:
      "“절대 그녀에게서 눈을 떼지 말 것” “절대 경호를 풀지 말 것” “절대 사랑에 빠지지 말 것” 전직 대통령을 경호했던 보디가드(케빈 코스트너)와 세계적인 톱스타 여가수(휘트니 휴스턴)의 이뤄질 수 없는 운명적인 사랑을 그린 모두의 인생 로맨스",
  },
  {
    title: "스트레인지",
    imageUrl: "/스트레인지.jpeg",
    movieUrl: "https://www.youtube.com/watch?v=jsfLsJTUIMU",
    summary:
      "전설적인 탐험가 가문 ‘클레이드’ 패밀리의 ‘서처 클레이드’는 아내 ‘메리디언’, 아들 ‘이든’과 함께 농장을 운영하며 평화로운 일상을 살고 있다. 어느 날, 대통령 ‘칼리스토’가 찾아와 위험에 빠진 아발로니아를 위해 도움을 요청하고 ‘서처’는 내키지 않지만 어쩔 수 없이 가족들과 모험에 나서게 된다. 서로 너무 다른 개성 강한 클레이드 패밀리는 누구도 본 적 없고, 가본 적 없는 신비롭고 경이로운 세계에서 무사히 집으로 돌아갈 수 있을까?",
  },
  {
    title: "스페이스",
    imageUrl: "/스페이스.jpeg",
    movieUrl: "https://www.youtube.com/watch?v=W8owRJMjJp8",
    summary:
      "평화로운 우주 여행을 마치고 지구로 돌아가던 ‘윌리’는 소행성 충돌로 미지의 행성에 불시착한다. 호기심 많은 '윌리'는 구조대가 올 때까지 만능 로봇 ‘버크’와 사랑스러운 새 친구 ‘플래시’와 함께 신나는 탐험을 시작하는데… 과연, ‘윌리’와 친구들은 생존 미션에 성공해 가족들을 다시 만날 수 있을까?",
  },
  {
    title: "크리스마스캐럴",
    imageUrl: "/크리스마스캐럴.jpeg",
    movieUrl: "https://www.youtube.com/watch?v=tWZc1z_wiCs",
    summary:
      "크리스마스 아침, 쌍둥이 동생 ‘월우’가 죽은 채로 발견된다. 단순 사고로 사건이 종결되자, 형 ‘일우’는 복수를 결심하고 ‘월우’와의 마지막 통화에서 들렸던 목소리를 찾아 스스로 소년원에 들어간다. 그곳에서 동생을 돌봐주던 상담교사 ‘조순우’의 도움을 받으며 비밀을 숨기고 있는 ‘손환’과 자신을 없애려는 ‘문자훈’, 그리고 무자비한 힘으로 군림하는 교정교사 ‘한희상’까지 폭력에 맞서 목숨을 건 싸움을 계획하는데…",
  },
  {
    title: "튜브펫",
    imageUrl: "/튜브펫.jpeg",
    movieUrl: "https://www.youtube.com/watch?v=Mwews2JwekY",
    summary:
      "굴지의 천연 피혁 기업 후계자인 ‘반석’ 이질적이게도 그는 동물 보호 벤처 기업의 대표다. 집으로 돌아와 가업을 이으라는 아버지, 죽어도 동물 가죽은 못 팔겠다는 아들! 결국 ‘반대길’(김진근) 회장은 아들의 기업을 무너트리기로 결심하고… 강아지 ‘라오뜨’와 고양이 ‘춘자’는 ‘반석’을 도와 그의 회사를 지켜낼 수 있을까? 아, 그리고 사랑도!",
  },
];
export const movieList = [
  {
    title: "데시벨",
    imageUrl: "/데시벨.jpeg",
    movieUrl: "https://www.youtube.com/watch?v=jGcQXD5EdkQ",
    summary:
      "물이 끓는 주전자 소리, 창문 여는 소리, 놀이터 아이들의 웃음 소리… 잠시 후, 거대한 굉음과 함께 단독 주택이 폭발했다는 뉴스 속보가 전해진다. 그리고, 뉴스를 지켜보던 전직 해군 부함장(김래원)에게 걸려온 전화 “소음이 커지면 터집니다. 사상 최대의 도심 폭탄 테러를 막기 위해 모든 비밀을 손에 쥔 폭탄 설계자를 찾아야만 하는데… 도심 한복판에서 벌어지는 사운드 테러 액션 오늘 반드시 이 폭발을 막아야만 한다!",
  },
  {
    title: "동감",
    imageUrl: "/동감.jpeg",
    movieUrl: "https://www.youtube.com/watch?v=X8b3KvxybA4",
    summary:
      "1999년, '용'은 첫눈에 반하게 된 '한솔'을 사로잡기 위해 친구에게 HAM 무전기를 빌린다. 2022년, ‘무늬’는 인터뷰 과제를 위해 오래된 HAM 무전기를 작동시킨다. '씨큐... 씨큐... 제 목소리 들리세요?' 개기 월식이 일어난 날, 시간을 뛰어넘어 기적처럼 연결된 ‘용’과 ‘무늬’는 서로의 사랑과 우정을 이야기하며 특별한 감정을 쌓아가는데... 1999 - 2022 마음을 수신합니다.",
  },
  {
    title: "에브리씽",
    imageUrl: "/에브리씽.webp",
    movieUrl: "https://www.youtube.com/watch?v=mWEEh9AxzEM",
    summary:
      "미국에 이민 와 힘겹게 세탁소를 운영하던 에블린은 세무당국의 조사에 시달리던 어느 날 남편의 이혼 요구와 삐딱하게 구는 딸로 인해 대혼란에 빠진다. 그 순간 에블린은 멀티버스 안에서 수천, 수만의 자신이 세상을 살아가고 있다는 사실을 알게 되고, 그 모든 능력을 빌려와 위기의 세상과 가족을 구해야 하는 운명에 처한다.",
  },
  {
    title: "올빼미",
    imageUrl: "/올빼미.jpeg",
    movieUrl: "https://www.youtube.com/watch?v=eRX5_KUyx7c",
    summary:
      "맹인이지만 뛰어난 침술 실력을 지닌 ‘경수’는 어의 ‘이형익’에게 그 재주를 인정받아 궁으로 들어간다. 그 무렵, 청에 인질로 끌려갔던 ‘소현세자’가 8년 만에 귀국하고, ‘인조’는 아들을 향한 반가움도 잠시 정체 모를 불안감에 휩싸인다. 아들의 죽음 후 ‘인조’의 불안감은 광기로 변하여 폭주하기 시작하고 세자의 죽음을 목격한 ‘경수’로 인해 관련된 인물들의 민낯이 서서히 드러나게 되는데...",
  },
  {
    title: "자백",
    imageUrl: "/자백.jpeg",
    movieUrl:
      "https://www.youtube.com/results?search_query=%EC%9E%90%EB%B0%B1+%EC%98%88%EA%B3%A0%ED%8E%B8",
    summary:
      "불륜 사실을 폭로하겠다는 협박을 받고 향한 호텔에서 의문의 습격을 당한 유민호(소지섭). 정신을 차려보니 함께 있던 김세희(나나)는 죽어있고, 범인은 흔적도 없이 사라졌다. 하루아침에 성공한 사업가에서 밀실 살인 사건의 유일한 용의자로 누명을 쓴 유민호는 무죄를 입증하기 위해 승률 100%의 변호사 양신애(김윤진)를 찾는다. 사건의 조각들이 맞춰지며 유민호가 감추고 있던 또 다른 사건이 모습을 드러내게 되는데…",
  },
  {
    title: "짱구",
    imageUrl: "/짱구.png",
    movieUrl: "https://www.youtube.com/watch?v=qAPdFL_Z1ck",
    summary:
      "명문 엘리트 양성학교에 체험 입학하게 된 짱구와 친구들! 좋은 성적을 내서 학교에 정식 입학하고 싶은 철수와 장난만 치려는 짱구는 크게 싸우게 된다. 그러던 중 학교에 도는 괴소문의 존재 ‘흡덩귀’에게 철수가 엉덩이를 물린 채 발견된다. ‘흡덩귀’에게 엉덩이를 물리면 엘리트 학생도 모지리로 변하게 되는데…. 범인은 과연 누구? 짱구는 사건을 해결하고 철수와의 우정을 지킬 수 있을까?!",
  },
  {
    title: "폴",
    imageUrl: "/폴.jpeg",
    movieUrl: "https://www.youtube.com/watch?v=jOPihnkCNmU",
    summary:
      "지구 생활 60년, 음주가무 돋는 어른용 ET가 온다! 4월, 지상 최대의 SF 코미디 지구 상륙! 외계인과 SF를 좋아하는 절친한 괴짜들 그램과 클라이브는 SF 코믹콘 행사에 참여하기 위해 미국 여행길에 오른다. '폴'을 이용해서 한 몫을 챙기려는 이들로부터 '폴'을 돕기 시작한 두 남자. 이제 쫓고 쫓기는 사상 최대의 글로벌 추격전이 시작된다!",
  },
  {
    title: "압꾸정",
    imageUrl: "/압꾸정.jpeg",
    movieUrl: "https://www.youtube.com/watch?v=I03P8Ec6lfg",
    summary:
      "샘솟는 사업 아이디어와 타고난 말빨의 압구정 토박이 ‘대국’(마동석)은 한때 잘나가던 실력 TOP 성형외과 의사 ‘지우’(정경호)를 만나게 된다. 재기를 꿈꾸는 그의 욕심과 잠재력을 한눈에 알아본 ‘대국’은 일생일대의 사업 수완을 발휘할 때가 왔음을 본능적으로 직감한다. ‘대국’은 인맥을 한데 모아 압구정을 대표하는 성형외과를 넘어, 아시아를 대표하는 뷰.티.도.시.를 꿈꾸는데…",
  },
];
